[
  {
    "Name": "Aman Nagar",
    "Email": "aman13nagar@gmail.com",
    "Phone": "+91 9588801001",
    "Skills": [
      "C",
      "C++",
      "Python",
      "JavaScript",
      "Windows",
      "LINUX/UNIX",
      "ReactJs",
      "NodeJs",
      "ExpressJs",
      "Material-UI",
      "Socket Io",
      "Ejs",
      "MongoDB",
      "Mongoose",
      "MySQL",
      "Git",
      "DraftJs",
      "MATLAB",
      "AutoCad",
      "English",
      "Hindi",
      "Database Management System(DBMS)",
      "Computer Networks",
      "Data Structures and Algorithms",
      "Operating Systems",
      "Object oriented programming"
    ],
    "Work Experience": "Aman Nagar has worked on several projects. In the Time Management System project (2024-FEB), he designed and implemented a task tracking system, developed a meeting scheduling module, and facilitated team collaboration through real-time communication tools and file sharing capabilities. Technologies used included Ejs, MongoDB, Express Js, Node Js, and SocketIo. In the Quiz Maker project (2024-JULY), he developed a quiz creation and management system using React and Material-UI, designed RESTful APIs using Node.js and Express, and enhanced the user experience by implementing features such as quiz creation, editing, and sharing. Technologies used included React Js, MongoDB, Express Js, Node Js, DraftJs, and Material-UI. In the Meal Planner project (2024-MAY), he developed a comprehensive meal planner application with a calendar-based view for scheduling meals, using React for frontend, Node.js and Express for backend, and MongoDB for database management.",
    "pdfUrl": "http://localhost:5000/uploads/1749921491633-Aman Nagar_121CS0194.pdf"
  },
  {
    "Name": "Rajdeep Das",
    "Email": "imraj071@gmail.com",
    "Phone": "+918794319624",
    "Skills": [
      "C",
      "C++",
      "HTML",
      "CSS",
      "Javascript",
      "React",
      "Windows",
      "Matlab",
      "MicrosoftSQL",
      "English",
      "Hindi",
      "Bengali",
      "DataStructures",
      "Algorithms",
      "DatabaseManagementSystem(DBMS)"
    ],
    "Work Experience": "The resume does not explicitly list any formal work experience. Instead, it showcases projects, achievements/certifications, and extra-curricular activities which demonstrate relevant skills and experience.  These sections highlight skills in web development using HTML, CSS, Javascript, and React, as well as knowledge of data structures, algorithms, and MATLAB. The extra-curricular activities describe involvement in the National Service Scheme (NSS) and coordination of guest lectures and workshops, indicating leadership and organizational skills.",
    "pdfUrl": "http://localhost:5000/uploads/1749921509260-Rajdeep_Das_Resume.pdf.pdf"
  },
  {
    "Name": "Ashish Padhy",
    "Email": "ashishpadhy1729@gmail.com",
    "Phone": "+91 6370120058",
    "Skills": [
      "JavaScript",
      "JAVA",
      "GoLang",
      "Python",
      "C/C++",
      "GraphQL",
      "Bash",
      "SQL",
      "Echo(Go)",
      "Node.js",
      "Express",
      "Next.js",
      "React",
      "Spring",
      "Redux",
      "Apollo GraphQL",
      "Git",
      "NestJS",
      "Flutter",
      "Flask",
      "Kubernetes",
      "Kafka",
      "Firebase",
      "Docker",
      "GIT",
      "PostgreSQL",
      "MySQL",
      "SQLite",
      "MongoDB",
      "Github Actions",
      "Arch Linux",
      "Mac",
      "Web",
      "GCP",
      "AWS",
      "Digital Ocean",
      "Oracle Cloud",
      "Public Speaking",
      "Time Management",
      "Leadership",
      "Event Management",
      "Writing"
    ],
    "Work Experience": "At Oracle as a Member of Technical Staff Intern (May 2024 - July 2024), Ashish engineered a traffic rerouting system using GoLang, GoBGP, and Juniper Route Reflectors, efficiently handling over 1 million route injections and more than 10,000 overrides. He constructed a custom build service leveraging Docker and JUnit, improving testing, building, and deployment speeds by 20%. Additionally, he developed an advanced plugin for network monitoring and route override application, enhancing network visualization with 5+ filters, search functionality, and table views, boosting user interaction by 15%. As a SDE Intern at Amplication (August 2023 - April 2024), he developed a platform utilizing Abstract Syntax Tree for back-end service generation in NestJS, significantly reducing user setup time by 25%. He also created 9+ Plugins integrating technologies such as Auth0, S3 Storage, Kafka, and Open-telemetry, enhancing backend customization and driving a 47% increase in the user base. As an Opensource Maintainer and TSC member at AsyncAPI (July 2023 - Present), Ashish established automated infrastructure for Slack channel and user group maintenance using Terraform, improving operational efficiency by 40%. He implemented a workflow for auto-updating fork branches, accelerating PR merge times by 34%. He enhanced AsyncAPI Studio by adding document sharing, refining CLI design with Oclif, and contributing to TypeScript migration, increasing deployment speed by 20%.  As a Full Stack Developer Intern at Cipher Schools (April 2023 - July 2023), Ashish launched a customizable resume builder using node-latex for backend and react-pdf for frontend, facilitating the creation of over 670 resumes in 3 months. He architected a Social Media Platform with microservices, utilizing Redux, RTK Query, and TypeScript, supporting 3,000+ daily users and 600,000+ monthly hits, integrating features like post reactions, commenting, user following, announcements, notifications, and image uploads, increasing user engagement by 25%.",
    "pdfUrl": "http://localhost:5000/uploads/1749921527608-Resume.pdf"
  }
]